h-3-15deg/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  10                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    body
    {
        type triSurfaceMesh;
        file "body.stl";
    };
    neighborhood
    {
        type triSurfaceMesh;
        file "neighborhood.stl";
    };
    refinementBox1
    {
        type searchableBox;
        min (0.00 2.70 0.0);
        max (12.1 3.40 1.8);
    };
   refinementBox2
   {
        type searchableBox;
        min (2.70 0.0 0.0);
        max (3.40 6.1 1.8);
   };
}

castellatedMeshControls
{
    maxLocalCells 5000000;
    maxGlobalCells 10000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 5;

    features
    (
        {
            file "body.eMesh";
            level 7;
        }
        {
            file "neighborhood.eMesh";
            level 5;
        }
    );

    refinementSurfaces
    {
        body
        {
            level (5 7);
        }
        neighborhood
        {
            level (5 5);
        }
    };
	
	refinementRegions
    {
        refinementBox1
        {
            mode inside;
            levels ((1E15 2));
        }
        refinementBox2
        {
            mode inside;
            levels ((1E15 2));
        }
    }

    resolveFeatureAngle 30;
    refinementRegions
    {
    };

    locationInMesh (1.05 0.55 0.3); // Ponto dentro da malha

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 4.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
    }

    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.25;
    nGrow 0;
    featureAngle 60;
    nRelaxIter 5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 130;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minFlatness 0.5;
    minVol 1e-13;
    minTetQuality 1e-9;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;

    nSmoothScale 4;
    errorReduction 0.75;
    relaxed
    {
        maxNonOrtho 75;
    }
}

debug 0;

mergeTolerance 1E-6;

// ************************************************************************* //
